# 数据清洗

In [1]:
import numpy as np
import pandas as pd

缺失数据处理

In [3]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.159635 -1.002413 -0.127110  0.825621
2013-01-02 -0.457239  0.759166 -0.837159 -1.711949
2013-01-03  1.068034 -0.300548  0.844382  0.152734
2013-01-04 -1.639561  0.347637  0.596834 -0.572324
2013-01-05  0.453744 -1.477984 -1.351453 -0.207561
2013-01-06  0.531679  1.178110  0.488840  0.439446

In [4]:
df < 0

                A      B      C      D
2013-01-01   True   True   True  False
2013-01-02   True  False   True   True
2013-01-03  False   True  False  False
2013-01-04   True  False  False   True
2013-01-05  False   True   True   True
2013-01-06  False  False  False  False

In [5]:
df1 = df[df < 0]
df1

                   A         B         C         D
2013-01-01 -0.159635 -1.002413 -0.127110       NaN
2013-01-02 -0.457239       NaN -0.837159 -1.711949
2013-01-03       NaN -0.300548       NaN       NaN
2013-01-04 -1.639561       NaN       NaN -0.572324
2013-01-05       NaN -1.477984 -1.351453 -0.207561
2013-01-06       NaN       NaN       NaN       NaN

In [5]:
df1.fillna('missing')

                   A         B          C         D
2013-01-01   missing -0.365296   -1.24367 -0.155312
2013-01-02   missing  -1.50002 -0.0455569 -0.768367
2013-01-03   missing   missing    missing -0.491468
2013-01-04   missing  -1.49671    missing -1.823922
2013-01-05 -0.795596 -0.743976    missing -1.491497
2013-01-06   missing  -2.09313   -0.29937 -1.178829

In [6]:
df1.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [7]:
print(df1)
pd.isnull(df1)

                   A         B         C         D
2013-01-01 -0.159635 -1.002413 -0.127110       NaN
2013-01-02 -0.457239       NaN -0.837159 -1.711949
2013-01-03       NaN -0.300548       NaN       NaN
2013-01-04 -1.639561       NaN       NaN -0.572324
2013-01-05       NaN -1.477984 -1.351453 -0.207561
2013-01-06       NaN       NaN       NaN       NaN

                A      B      C      D
2013-01-01  False  False  False   True
2013-01-02  False   True  False  False
2013-01-03   True  False   True   True
2013-01-04  False   True   True  False
2013-01-05   True  False  False  False
2013-01-06   True   True   True   True

In [8]:
df1.isnull().sum()

A    3
B    3
C    3
D    3
dtype: int64

处理重复数据

In [10]:
df2 = pd.DataFrame({'data1' : ['a'] * 3 + ['b'] * 3,
                       'data2' : np.random.randint(0, 3, 6)})
df2

  data1  data2
0     a      0
1     a      0
2     a      2
3     b      2
4     b      1
5     b      1

In [11]:
df2.data1.unique()

array(['a', 'b'], dtype=object)

In [12]:
df2.duplicated() # 判断是否有重复

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [13]:
df2.drop_duplicates()  # 默认的当前的数据会和它之前数据进行比较

  data1  data2
0     a      0
2     a      2
3     b      2
4     b      1

In [14]:
df2.drop_duplicates('data1') # 比较的时候可以把所有列的数据进行比较 去重，，也可以指定列进行比较去重

  data1  data2
0     a      0
3     b      1

## map函数  
map会应用的每一个元素，接收一个函数，这个函数可以是普通的函数，也可以是匿名函数，然后 series中每一元素都会一一传给这个函数

In [14]:
ser = pd.Series(np.random.randint(0,10,10))
ser

0    3
1    9
2    3
3    3
4    0
5    8
6    4
7    9
8    1
9    5
dtype: int32

In [30]:
ser.map(lambda x : x ** 2)

0     9
1    81
2     9
3     9
4     0
5    64
6    16
7    81
8     1
9    25
dtype: int64

In [17]:
df1

                   A         B         C         D
2013-01-01 -0.159635 -1.002413 -0.127110       NaN
2013-01-02 -0.457239       NaN -0.837159 -1.711949
2013-01-03       NaN -0.300548       NaN       NaN
2013-01-04 -1.639561       NaN       NaN -0.572324
2013-01-05       NaN -1.477984 -1.351453 -0.207561
2013-01-06       NaN       NaN       NaN       NaN

In [32]:
df1.apply(lambda x : x ** 2)  #apply也是元素级的操作,,,推荐用apply

                   A         B         C         D
2013-01-01  0.025483  1.004831  0.016157       NaN
2013-01-02  0.209067       NaN  0.700835  2.930770
2013-01-03       NaN  0.090329       NaN       NaN
2013-01-04  2.688159       NaN       NaN  0.327555
2013-01-05       NaN  2.184435  1.826425  0.043081
2013-01-06       NaN       NaN       NaN       NaN

In [34]:
df1.A.map(lambda x : x ** 2)   # 可以把列名看成df的属性

2013-01-01    0.025483
2013-01-02    0.209067
2013-01-03         NaN
2013-01-04    2.688159
2013-01-05         NaN
2013-01-06         NaN
Freq: D, Name: A, dtype: float64

* 数据替换repalce

In [35]:
# 替换单个值
print(ser)
ser.replace(4, -100)

0    3
1    9
2    3
3    3
4    0
5    8
6    4
7    9
8    1
9    5
dtype: int32

0      3
1      9
2      3
3      3
4      0
5      8
6   -100
7      9
8      1
9      5
dtype: int32

In [29]:
# 替换多个值
print(ser)
ser.replace([4, 9], -100)

0    2
1    4
2    4
3    3
4    5
5    9
6    0
7    4
8    5
9    6
dtype: int32

0      2
1   -100
2   -100
3      3
4      5
5   -100
6      0
7   -100
8      5
9      6
dtype: int32

In [36]:
# 替换多个值
print(ser)
ser.replace([6, 9], [-100, -200])

0    3
1    9
2    3
3    3
4    0
5    8
6    4
7    9
8    1
9    5
dtype: int32

0      3
1   -200
2      3
3      3
4      0
5      8
6      4
7   -200
8      1
9      5
dtype: int64